<template>
    <div>
       <div class="header">
   <div class="container">
    <h2 class="logo">FULCRUM</h2>
    <input type="checkbox" id="chk">
    <label for="chk" class="show-menu-btn">
      <i class="fas fa-align-justify"></i>
    </label>

    <ul class="menu">
      <div class="linksHeader">
          <a href="#"><i class="fas fa-search"></i></a>
          <router-link :to="'/login'"><i class="fas fa-user"></i></router-link> 
          <a href="#"><i class="fas fa-plus"></i></a>
          <a href="#"><i class="fas fa-home"></i></a>
      </div>

      <div class="socialHeader">
          <a href="#"><i class="fab fa-instagram"></i></a>
          <a href="#"><i class="fab fa-twitter"></i></a>
      </div>

      <!-- <a href="#"><i class="fab fa-telegram"></i></a> -->

      <label for="chk" class="hide-menu-btn">
        <i class="fas fa-times"></i>
      </label>
    </ul>
    </div>
  </div>

  <div class="subHeader">
    <div class="container">
      <div class="navSubHeader">
        <div class="subHeaderCategory">Category</div>
        <div class="subHeaderKind">Kind</div>
        <div class="subHeaderAuthor">Author</div>
        <div class="subHeaderSort">Sort</div>
      </div>
    </div>
  </div>
   
   <div class="content">
       <div class="container">
           <p class="mainContentP">Наша мета - об’єднати креативних людей</p>
           
           <p class="infoProjContent">Цей проект призначений для вільного розповсюдження текстової інформації (книги, вірші, статті тощо).</p>
           
           
            <ul class="portfolio-grid" id="works">

                <li v-for="work in works" class="grid-item">
                   <div class="items_wrap">
                          <img :src="work.image">
                              <div class="grid-hover">
                                <h1><router-link :to="'/profile/'+work._id.$oid"> {{work.name}}</router-link> </h1>
                                <p>{{work.author}}</p>
                              </div>
                            </a>  
                   </div>
                </li>

            </ul>
       </div>
   </div>
   
   <div class="footer">
       <div class="container">
           <div class="bookFooter"></div>
           <p>fulcrum</p>
       </div>
   </div>

    </div>
</template>

<script>
import Vue from "vue";
import Vuex from "vuex";
import axios from "axios";
import VueAxios from "vue-axios";
import VueTypedJs from 'vue-typed-js';
import Typed from 'typed.js';
 

Vue.use(VueAxios, axios)

export default {
    components : {
	},
    data(){
        return{
            works1 : [],
            works : [
                {"_id":{"$oid":"5d9c2915670bf70e748cf9d1"},"name":"Страна Высоких","section":"Poem","genre":"Social verse","author":"Vitaliy Kotkin","text":"<p>Расскаты грома по небу ночному,</p>\n<p>Слышны были и немому и глухому,</p>\n<p>А слепой безногий дед,</p>\n<p>Бежал за ними в след,</p>\n<p>Но впереди лишь тени были,</p>\n<p>Что били хозяев своих,</p>\n<p>Там мышка кошку гнала в нору,</p>\n<p>А тип со странной формой,</p>\n<p>Стоял погруженный в кому,</p>\n<p>Без мыслей о высоком,</p>\n<p>Ему б платили, он стоял,</p>\n<p>Перестали, он б стрелял,</p>\n<p>Ещё дальше, где-то в переулке,</p>\n<p>Стояла пара человек, возле дурки,</p>\n<p>Их послали в след за теми,</p>\n<p>Кто назвал планету шаром,</p>\n<p>Кто сказал что бога нет,</p>\n<p>И тут же Божа Кара,</p>\n<p>Снезошла на них,</p>\n<p>Карма.. Может...</p>\n<p>Но скорее просто кожа,</p>\n<p>Черная была...</p>\n<p>Кто быстрее прыгнет,</p>\n<p>Того и тапки,</p>\n<p>Кто заплатит больше,</p>\n<p>Тот и раньше встанет,</p>\n<p>Часов в 3 утра,</p>\n<p>С другом водкой,</p>\n<p>Пошел управлять подводной лодкой,</p>\n<p>Он взорвал Америку, всю Гейропу,</p>\n<p>Стал героем...</p>\n<p>Получил два жетона на метро,</p>\n<p>Один домой, второй на свалку...</p>","publicdate":{"$date":{"$numberLong":"1554843600000"}},"preview":"","image":"./src/img/covers/poem2.jpg","__v":{"$numberInt":"0"}},
                {"_id":{"$oid":"5d9c29df670bf70e748cf9d2"},"name":"Штиль","section":"Poem","genre":"Philosophical verse","author":"Vitaliy Kotkin","text":"<p>Мнимое спокойствие снаружи,</p>\n<p>А внутри залпы со всех орудий,</p>\n<p>Стены разукрашенные разрушали,</p>\n<p>Дробили в пыль фундамент,</p>\n<p>От мысли лишней волноваться начинали,</p>\n<p>То море, озеро и океан,</p>\n<p>В которых всех одна вода текла,</p>\n<p>В них было все для штиля,</p>\n<p>Безветренной погоды,</p>\n<p>Но штормы внутри не давали им покоя,</p>\n<p>Бушевали, воду всю перемешали,</p>\n<p>Все корабли отправили на свалку,</p>\n<p>Рыбу выбросили во льдах Антарктики,</p>\n<p>Длились штормы не переставая,</p>\n<p>Достали они даже до ада с раем,</p>\n<p>Перемешали демонов и ангелов,</p>\n<p>Рогатым и хвостатым нимбы по вручали,</p>\n<p>А тем что с крыльями,</p>\n<p>Тризубци наточили,</p>\n<p>А Бог небесный,</p>\n<p>С адским бесом,</p>\n<p>Обручились наконец-то...</p>","publicdate":{"$date":{"$numberLong":"1557435600000"}},"preview":"","image":"./src/img/covers/poem3.jpg","__v":{"$numberInt":"0"}},
                {"_id":{"$oid":"5d9c2bb6670bf70e748cf9d3"},"name":"Эффект ограниченных возможностей","section":"Article","genre":"Social issues","author":"Veronika Omelchuk","text":"<p>Перед тобой весь мир, твое же мировоззрение ограничено рамками этого города. Ты наверняка сочтешь эти слова глупыми и до боли наивными, но в этом и ловушка твоего псевдокритического мышления. Ты можешь сделать всё, что только можешь вообразить. И как же легко тобой управлять, обрезав кругозор. Тебя ограничат средства или связи. Нет, тебя ограничишь лишь ты сам.</p>\n<p>К чему строить планы и прикладывать усилия для их достижения? А вдруг всё это время окажется попусту упущенным? Вдруг я не смогу? А вдруг ты будешь жить так же пусто и бессмысленно, как миллионы людей?\nПросто пойми одну важную вещь: твои возможности не ограниченны ничем и никем, кроме тебя. Пойми, что ты на самом деле боишься, просто боишься, банальный страх приземляет все твои порывы взлететь. Но бояться – не значит быть трусом. Быть трусом – значит бездействовать. Если ты думаешь, что мне не страшно, ты сильно заблуждаешься. Я постоянно боюсь. Но мне ничто так не страшно, как обычная жизнь. Меня ничто так не пугает, как быть забытой после смерти. И ничто мне так не чуждо, как ограниченность четырьмя стенами, как однообразный ежедневный быт. Вот, я с 8 до 8 на работе. зайду в магазин, посижу в кафешке с друзьями, после уткнусь в монитор на пару часов. Вот, я усну и проснусь и всё по новой.</p>\n<p>А мечты – для подростков. Но вот, что я тебе хочу сказать: стереотип про мечты и подростков существует лишь благодаря тому, что ты про свою забыл. Да, ты просто боишься признать, что боишься жить неравнодушно, потому что боишься обжечься в очередной раз, когда что-то не получится. Жить равнодушно и равнодушно умереть. Ты перестал верить в мечту, а после – в себя. Ты отказался любить, потому что тебя однажды предали и отказался творить, потому что однажды не вышло. Но ты же не отказался от жизни лишь потому, что можешь умереть? Неудача – признак стараний, а конфликт – любви. Ты можешь и дальше бояться упасть, можешь бояться быть собой, можешь много чего бояться. Но тогда просто признай, что дело не в ограниченных возможностях, а в одноименном эффекте, которому ты поддался.</p>","publicdate":{"$date":{"$numberLong":"1547071200000"}},"preview":"<p>Ты отказался любить, потому что тебя однажды предали и отказался творить, потому что однажды не вышло. Но ты же не отказался от жизни лишь потому, что можешь умереть? Неудача – признак стараний, а конфликт – любви. Ты можешь и дальше бояться упасть, можешь бояться быть собой, можешь много чего бояться. Но тогда просто признай, что дело не в ограниченных возможностях, а в одноименном эффекте, которому ты поддался.</p>","image":"./src/img/covers/article1.jpg","__v":{"$numberInt":"0"}},
                {"_id":{"$oid":"5daa02b7fbb2bf916c841309"},"name":"Ритм","section":"Poem","genre":"Heart-to-heart","author":"Vitaliy Kotkin","text":"<p>Интересно что тебе снится?</p>\n<p>Миксер сломанный на кухне?</p>\n<p>Или свечи что давно потухли?</p>\n<p>Чьих воск, стал будто кремень,</p>\n<p>А фитиль похожим был на цепи,</p>\n<p>Они сковали даже свет,</p>\n<p>А их сковал миксер сломанный в ответ,</p>\n<p>Или вдруг мельком я?</p>\n<p>Лишь на миг, один момент,</p>\n<p>Но стало легче, проще</p>\n<p>Смотреть вперёд, чуть ниже,</p>\n<p>Где глаза твои же,</p>\n<p>Смотрели в сторону заката,</p>\n<p>Горящего в пламени плаката,</p>\n<p>Что закрывал дыры в стенах,</p>\n<p>А сейчас просто порванный повис.</p>\n<p>А может, поезда колесный стук?</p>\n<p>Тук-тук, тук-тук,</p>\n<p>Он в ритм сердца бьётся твоего,</p>\n<p>Сражается во имя дамы,</p>\n<p>Или всеми позабытой славы,</p>\n<p>Та нет, отнюдь,</p>\n<p>Просто возьми и забудь,</p>\n<p>Как проснешься не вспоминай,</p>\n<p>Иди тихо, спокойно, позавтракай,</p>\n<p>И забудь, как, меня, зовут..</p>","publicdate":{"$date":{"$numberLong":"1575925200000"}},"preview":"","image":"./src/img/covers/poem1.jpg","__v":{"$numberInt":"0"}},
                {"_id":{"$oid":"5daa054efbb2bf916c84130a"},"name":"Мотивация","section":"Article","genre":"Social issues","author":"Veronika Omelchuk","text":"<p>Знаешь, бывает услышишь какую-нибудь фразу, к примеру, что жизнь только одна, что пора действовать, не быть стадом, развиваться и подобные. И в этот момент тебя будто пробивает: «Всё, сегодня же брошу пить», «Завтра запишусь на курсы по английскому», «С понедельника пойду в спортзал», «Нужно найти работу» и много, много всего на самом деле бессмысленного. Бессмысленного до тех пор, пока не найдёшь смысл, как бы очевидно не звучало.</p>\n<p>Мы часто придумываем планы на день, может, даже на месяц или год, но они не несут в себе никакой ценности. Это просто расписание быта: сходить на работу, пообедать, в зал, потом на вечеринку с друзьями, найти другую работу и других друзей, переехать в другой город. И, проживая так день за днём, а после год за годом, ты посмотришь то же самое видео и услышишь ту же самую «мотивирующую» фразу, и подумаешь: «Блин, надо записаться на курсы», «Чёрт, а я ведь забросил зал» и не поймёшь, в чём подвох. Почему ты тогда вдохновился, но сейчас остался на том же месте? Почему вдохновился сейчас, но и на следующий год ничего не изменится? Потому, что ты не нашел смысл.</p>\n<p>Эти фразы вдохновляют, это правда. Но когда вдохновение проходит, ты остаёшься ни с чем. А оно непременно пройдёт, это такая же эмоция, как грусть или радость. Но бывают такие фразы, такие моменты, когда тебя осеняет мысль: «Вот, чего я хочу от жизни, это моё». И после них твоя жизнь никогда не станет прежней, просто потому, что в ней появился смысл. Появилась мотивация. Мотивация длиною в жизнь, а не вдохновение. Тогда в моменты счастья ты продолжаешь воплощать свой смысл в жизнь. В моменты разочарования и отчаяния ты делаешь своё любимое дело. В любой момент. Тебе больше не нужно вдохновение, чтобы действовать. Ты просто делаешь, потому что точно знаешь, зачем ты это делаешь.</p>\n<p>Да, будут моменты, когда тебе покажется, что всё это бессмысленно, но ты не сможешь послать это дело к чёрту, ты вскоре придёшь в себя и продолжишь. Однажды, погрязнув в быту на месяц или несколько лет, ты об этом забудешь, забудешь, зачем живешь. Абсурдно, правда? Но будут и такие моменты. Потом вспомнишь и снова начнёшь жить. </p>\n<p>Сложно сказать, что именно это будет, какая такая деятельность. Но это точно не конечные цели. Смысл жизни, к сожалению, вещь недосягаемая. Эта та самая цель в твоей жизни, которую ты никогда не сможешь достичь. А ходить в зал три раза в неделю вещь вполне реальная, найти работу, переехать… Невозможно достичь такой цели, как делать музыку, ты можешь бесконечно создавать новые мелодии, до самой смерти. И такого стремления, как мотивация других людей. Ты можешь менять отрасли, жанры, позиции, но твой смысл жизни навсегда останется константой.</p>","publicdate":{"$date":{"$numberLong":"1573333200000"}},"preview":"<p>Пора действовать, не будь стадом, развивайся! Эти фразы вдохновляют, это правда. Но когда вдохновение проходит, ты остаёшься ни с чем. А оно непременно пройдёт, это такая же эмоция, как грусть или радость. Но бывают такие фразы, такие моменты, когда тебя осеняет мысль: «Вот, чего я хочу от жизни, это моё». И после них твоя жизнь никогда не станет прежней, просто потому, что в ней появился смысл. Появилась мотивация. Мотивация длиною в жизнь, а не вдохновение. Тогда в моменты счастья ты продолжаешь воплощать свой смысл в жизнь. В моменты разочарования и отчаяния ты делаешь своё любимое дело. В любой момент. Тебе больше не нужно вдохновение, чтобы действовать. Ты просто делаешь, потому что точно знаешь, зачем ты это делаешь.</p>","image":"./src/img/covers/article2.jpg","__v":{"$numberInt":"0"}},
                {"_id":{"$oid":"5daa06bcfbb2bf916c84130b"},"name":"Величие","section":"Book","genre":"Social issues","author":"Veronika Omelchuk","text":"<p>Знаешь, бывает услышишь какую-нибудь фразу, к примеру, что жизнь только одна, что пора действовать, не быть стадом, развиваться и подобные. И в этот момент тебя будто пробивает: «Всё, сегодня же брошу пить», «Завтра запишусь на курсы по английскому», «С понедельника пойду в спортзал», «Нужно найти работу» и много, много всего на самом деле бессмысленного. Бессмысленного до тех пор, пока не найдёшь смысл, как бы очевидно не звучало.</p>\n<p>Мы часто придумываем планы на день, может, даже на месяц или год, но они не несут в себе никакой ценности. Это просто расписание быта: сходить на работу, пообедать, в зал, потом на вечеринку с друзьями, найти другую работу и других друзей, переехать в другой город. И, проживая так день за днём, а после год за годом, ты посмотришь то же самое видео и услышишь ту же самую «мотивирующую» фразу, и подумаешь: «Блин, надо записаться на курсы», «Чёрт, а я ведь забросил зал» и не поймёшь, в чём подвох. Почему ты тогда вдохновился, но сейчас остался на том же месте? Почему вдохновился сейчас, но и на следующий год ничего не изменится? Потому, что ты не нашел смысл.</p>\n<p>Эти фразы вдохновляют, это правда. Но когда вдохновение проходит, ты остаёшься ни с чем. А оно непременно пройдёт, это такая же эмоция, как грусть или радость. Но бывают такие фразы, такие моменты, когда тебя осеняет мысль: «Вот, чего я хочу от жизни, это моё». И после них твоя жизнь никогда не станет прежней, просто потому, что в ней появился смысл. Появилась мотивация. Мотивация длиною в жизнь, а не вдохновение. Тогда в моменты счастья ты продолжаешь воплощать свой смысл в жизнь. В моменты разочарования и отчаяния ты делаешь своё любимое дело. В любой момент. Тебе больше не нужно вдохновение, чтобы действовать. Ты просто делаешь, потому что точно знаешь, зачем ты это делаешь.</p>\n<p>Да, будут моменты, когда тебе покажется, что всё это бессмысленно, но ты не сможешь послать это дело к чёрту, ты вскоре придёшь в себя и продолжишь. Однажды, погрязнув в быту на месяц или несколько лет, ты об этом забудешь, забудешь, зачем живешь. Абсурдно, правда? Но будут и такие моменты. Потом вспомнишь и снова начнёшь жить. </p>\n<p>Сложно сказать, что именно это будет, какая такая деятельность. Но это точно не конечные цели. Смысл жизни, к сожалению, вещь недосягаемая. Эта та самая цель в твоей жизни, которую ты никогда не сможешь достичь. А ходить в зал три раза в неделю вещь вполне реальная, найти работу, переехать… Невозможно достичь такой цели, как делать музыку, ты можешь бесконечно создавать новые мелодии, до самой смерти. И такого стремления, как мотивация других людей. Ты можешь менять отрасли, жанры, позиции, но твой смысл жизни навсегда останется константой.</p>","publicdate":{"$date":{"$numberLong":"1547067600000"}},"preview":"<p>А к чему эта цель: стать великой, многим запомниться, к чему? Я же хотела вдохновлять людей, но тут не нужно величие. Да и не понятно вовсе, что это значит: быть великим. Это что? Это когда с тобой происходит? Когда количество твоих поклонников достигает тысячи или миллиона? Когда ты смело делаешь что-то вопреки всем устоям и нормам, или когда изо всех сил пытаешься сохранить традиции? Может в тот момент, когда кто-то назовёт тебя великим или когда ты почувствуешь себя таковым? В какой момент времени ты воплотишь свою странную мечту в жизнь?</p>","image":"./src/img/covers/book1.jpg","__v":{"$numberInt":"0"}}
            ]
        }
    },
    methods : {
        diff: function(arr1, arr2) {
            return arr1.filter(value => -1 !== arr2.indexOf(value));
        }
    },
    mounted(){
        Vue.axios.get('http://localhost:3000/works').then(response => {
            console.log(response.data);
            this.works1 = response.data;
        })
    }
}

</script>

<style scoped>
</style>